src/InformationRegisters/ObjectVersioningSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ObjectVersioningSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Mode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ObjectVersioningModes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Use</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VersionLifetime</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VersionLifetimes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ObjectType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ObjectVersioningModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ObjectVersioningModes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>VersionizeOnWrite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VersionizeOnPost</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VersionizeOnStart</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DontVersionize</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ObjectVersioningSettings/Ext/RecordSetModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS 

Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	For Each Row In ThisObject Do
		If Row.Mode = Enums.ObjectVersioningModes.DontVersionize Then
			Row.Use = False;
		Else
			Row.Use = True;
		EndIf;
	EndDo;
	
EndProcedure


#EndIf
